---
kind: enumMember
id: F:Autodesk.Revit.DB.ExternalResourceLoadStatus.ServerThrewException
enum: Autodesk.Revit.DB.ExternalResourceLoadStatus
source: html/2f8c9146-6ae2-49a7-0a8b-cd544077602e.htm
---
# Autodesk.Revit.DB.ExternalResourceLoadStatus.ServerThrewException

The server identified by the ExternalResourceReference threw an exception while attempting to load a resource.